Repository: devdasx/Aura-Wallet
Catalog: BitcoinAIWallet/Localization/*.lproj/Localizable.strings
Languages: ar, es

# error.api
source: Server error. Please try again later.
ar: خطأ في الخادم. يرجى المحاولة لاحقاً.
es: Error del servidor. Por favor, intenta más tarde.

# error.unknown
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.
es: Ocurrió un error inesperado. Por favor, intenta de nuevo.

# error.wallet_not_ready
source: Wallet is not ready. Please ensure your wallet is set up and try again.
ar: المحفظة غير جاهزة. يرجى التأكد من إعداد محفظتك والمحاولة مرة أخرى.
es: La billetera no está lista. Por favor, asegúrate de que tu billetera esté configurada e intenta de nuevo.

# error.fee_estimation_failed
source: Unable to estimate network fees. Please try again.
ar: تعذر تقدير رسوم الشبكة. يرجى المحاولة مرة أخرى.
es: No se pudieron estimar las comisiones de red. Por favor, intenta de nuevo.

# error.seed_phrase_invalid
source: The recovery phrase is invalid. Please check your words and try again.
ar: عبارة الاسترداد غير صالحة. يرجى التحقق من كلماتك والمحاولة مرة أخرى.
es: La frase de recuperación no es válida. Por favor, verifica tus palabras e intenta de nuevo.

# biometric.reason
source: Authenticate to access your wallet
ar: قم بالمصادقة للوصول إلى محفظتك
es: Autentícate para acceder a tu billetera

# biometric.sign_reason
source: Authenticate to sign this transaction
ar: قم بالمصادقة لتوقيع هذه المعاملة
es: Autentícate para firmar esta transacción

# format.usd_amount
source: $%@ USD
ar: %@ دولار أمريكي

# format.confirmation_count
source: %d confirmations
ar: %d تأكيد
es: %d confirmaciones

# format.estimated_minutes
source: ~%d minutes
ar: ~%d دقيقة
es: ~%d minutos

# format.utxo_count
source: %d UTXOs
ar: %d مخرجات غير منفقة

# format.greeting_with_name
source: Hey, **%@**! Your wallet is ready. What would you like to do?
ar: مرحباً، %@!
es: ¡Hola, %@!

# chat.price_response_template
source: **Bitcoin** is currently trading at **%@ %@**.
ar: سعر البتكوين حالياً %@ %@.
es: Bitcoin cotiza actualmente a %@ %@.

# chat.price_fetching
source: Fetching the latest Bitcoin price...
ar: جارٍ جلب أحدث سعر للبتكوين...
es: Obteniendo el precio más reciente de Bitcoin...

# chat.convert_response_template
source: %@ %@ is approximately %@ BTC at the current rate.
ar: %@ %@ يعادل تقريباً %@ BTC بالسعر الحالي.
es: %@ %@ equivale aproximadamente a %@ BTC al tipo de cambio actual.

# chat.new_address_generated
source: Fresh receive address generated!
ar: جارٍ إنشاء عنوان استقبال جديد...
es: Generando una nueva dirección de recepción...

# chat.wallet_health_title
source: Wallet Health Report
ar: تقرير صحة المحفظة
es: Informe de Salud de la Billetera

# chat.transaction_count_label
source: Total Transactions: **%d**
ar: إجمالي المعاملات: %d
es: Total de Transacciones: %d

# chat.wallet_health_status
source: Your wallet is healthy and synced.
ar: محفظتك سليمة ومتزامنة.
es: Tu billetera está saludable y sincronizada.

# chat.export_history_response
source: Preparing your transaction history for export... This will generate a **CSV file** of all your transactions.
ar: جارٍ تحضير سجل المعاملات للتصدير... سيتم إنشاء ملف CSV لجميع معاملاتك.
es: Preparando tu historial de transacciones para exportar... Se generará un archivo CSV de todas tus transacciones.

# chat.utxo_list_response
source: Your wallet has **%d** unspent transaction outputs (UTXOs). Each UTXO represents a spendable coin in your wallet.
ar: محفظتك تحتوي على %d مخرجات غير منفقة (UTXOs). كل UTXO يمثل عملة قابلة للإنفاق.
es: Tu billetera tiene %d salidas de transacciones no gastadas (UTXOs). Cada UTXO representa una moneda gastable.

# chat.bump_fee_response_with_txid
source: To bump the fee on transaction %@, you'll need RBF (Replace-By-Fee) support. This feature is coming soon.
ar: لزيادة رسوم المعاملة %@، تحتاج دعم RBF. هذه الميزة قادمة قريباً.
es: Para aumentar la comisión de la transacción %@, necesitas soporte RBF. Esta función estará disponible pronto.

# chat.bump_fee_response
source: Fee bumping (**RBF**) allows you to speed up a pending transaction by increasing its fee. Specify the transaction ID to bump.
ar: زيادة الرسوم (RBF) تتيح لك تسريع معاملة معلقة. حدد معرف المعاملة للتسريع.
es: El aumento de comisión (RBF) te permite acelerar una transacción pendiente. Especifica el ID de la transacción.

# chat.network_connected
source: Connected — wallet synced with the Bitcoin network.
ar: حالة الشبكة: متصل. محفظتك متزامنة مع شبكة البتكوين.
es: Estado de red: Conectado. Tu billetera está sincronizada con la red Bitcoin.

# chat.network_disconnected
source: Unable to reach the network. Check your internet connection.
ar: حالة الشبكة: غير متصل. يرجى التحقق من اتصالك بالإنترنت.
es: Estado de red: Sin conexión. Por favor, verifica tu conexión a internet.

# chat.about_response
source: **Bitcoin AI Wallet** is a self-custodial Bitcoin wallet with an AI-powered chat interface. • Your keys **never** leave this device • **Zero** external dependencies • All cryptography built from scratch
ar: محفظة بتكوين AI هي محفظة ذاتية الحفظ بواجهة دردشة ذكية. مفاتيحك لا تغادر جهازك أبداً. بدون تبعيات خارجية.
es: Bitcoin AI Wallet es una billetera Bitcoin de auto-custodia con interfaz de chat inteligente. Tus claves nunca salen de tu dispositivo. Sin dependencias externas.

# chat.smart_fallback
source: I can help you with that! • Say **"balance"** to check your funds • Say **"send"** or **"receive"** for transactions • Say **"fees"** or **"price"** for market info • Say **"help"** to see all commands
ar: يمكنني مساعدتك! جرب سؤالي عن رصيدك، إرسال أو استقبال بتكوين، عرض الرسوم، أو سعر BTC. اكتب "مساعدة" لعرض جميع الأوامر.
es: ¡Puedo ayudarte! Intenta preguntarme sobre tu saldo, enviar o recibir Bitcoin, ver comisiones o el precio de BTC. Escribe "ayuda" para ver todos los comandos.

# chat.nothing_to_confirm
source: Nothing pending to confirm right now. Start a new transaction by saying **"send"**.
ar: لا يوجد شيء معلق للتأكيد الآن. يمكنك بدء معاملة جديدة بكتابة "ارسل".
es: No hay nada pendiente para confirmar. Puedes iniciar una nueva transacción escribiendo "enviar".

# chat.help_title
source: Here's what I can help you with:
ar: إليك ما يمكنني مساعدتك به:
es: Esto es lo que puedo hacer por ti:

# chat.ask_for_address
source: Where would you like to send? Please provide a **Bitcoin address**.
ar: إلى أين تريد الإرسال؟ يرجى تقديم عنوان بتكوين.
es: ¿A dónde quieres enviar? Por favor, proporciona una dirección Bitcoin.

# chat.ask_for_amount
source: How much would you like to send? Enter an amount in **BTC** or **sats**.
ar: كم تريد أن ترسل؟ أدخل المبلغ بـ BTC أو sats.
es: ¿Cuánto quieres enviar? Ingresa una cantidad en BTC o sats.

# chat.operation_cancelled
source: Operation cancelled. Let me know if you need anything else.
ar: تم إلغاء العملية. أخبرني إذا احتجت أي شيء آخر.
es: Operación cancelada. Avísame si necesitas algo más.

# chat.balance_hidden
source: Balance hidden for privacy. Say **"show balance"** to reveal it.
ar: رصيدك مخفي الآن للخصوصية. اكتب "اظهر الرصيد" لإظهاره.
es: Tu saldo está oculto por privacidad. Escribe "mostrar saldo" para revelarlo.

# chat.balance_shown
source: Your balance is now visible.
ar: رصيدك ظاهر الآن.
es: Tu saldo ahora es visible.

# chat.wallet_refreshing
source: Refreshing your wallet... This may take a moment.
ar: جارٍ تحديث محفظتك... قد يستغرق هذا لحظة.
es: Actualizando tu billetera... Esto puede tomar un momento.

# chat.wallet_refreshed
source: Wallet synced successfully!
ar: تمت مزامنة المحفظة بنجاح!
es: ¡Billetera sincronizada exitosamente!

# chat.testnet_not_supported
source: Testnet addresses are not supported. Please use a mainnet Bitcoin address.
ar: عناوين شبكة الاختبار غير مدعومة. يرجى استخدام عنوان بيتكوين على الشبكة الرئيسية.
es: Las direcciones de testnet no son compatibles. Por favor usa una dirección de Bitcoin en mainnet.

# tip.snd_1.title
source: Send in Any Currency
ar: أرسل بأي عملة
es: Envía en Cualquier Moneda

# tip.snd_1.body
source: Try: "send $50 to bc1q..." — I convert any currency automatically!
ar: جرّب: "ارسل ٥٠ دولار الى bc1q..." — أحوّل أي عملة تلقائياً!
es: Prueba: "enviar $50 a bc1q..." — ¡Convierto cualquier moneda automáticamente!

# tip.snd_2.title
source: Send All
ar: أرسل الكل
es: Enviar Todo

# tip.snd_2.body
source: Say "send all to bc1q..." to sweep your entire balance in one transaction.
ar: قل "ارسل الكل الى bc1q..." لتحويل رصيدك بالكامل في معاملة واحدة.
es: Di "enviar todo a bc1q..." para barrer tu saldo completo en una transacción.

# tip.snd_3.title
source: Keep a Reserve
ar: احتفظ باحتياطي
es: Mantén una Reserva

# tip.snd_3.body
source: Try: "send all minus 0.001 to bc1q..." to keep a small reserve behind.
ar: جرّب: "ارسل الكل ناقص 0.001 الى bc1q..." للاحتفاظ برصيد صغير.
es: Prueba: "enviar todo menos 0.001 a bc1q..." para mantener una pequeña reserva.

# tip.snd_4.title
source: Send in Sats
ar: أرسل بالساتوشي
es: Envía en Sats

# tip.snd_4.body
source: Try: "send 50000 sats to bc1q..." — I accept sats, BTC, or any fiat currency.
ar: جرّب: "ارسل ٥٠٠٠٠ sats الى bc1q..." — أقبل sats أو BTC أو أي عملة.
es: Prueba: "enviar 50000 sats a bc1q..." — Acepto sats, BTC o cualquier moneda fiat.

# tip.snd_5.title
source: Choose Your Speed
ar: اختر السرعة
es: Elige Tu Velocidad

# tip.snd_5.body
source: Say "use fast fee" or "use slow fee" when sending to control confirmation speed.
ar: قل "استخدم رسوم سريعة" أو "استخدم رسوم بطيئة" للتحكم بسرعة التأكيد.
es: Di "usar comisión rápida" o "usar comisión lenta" al enviar para controlar la velocidad.

# tip.snd_6.title
source: Quick Redo
ar: إعادة سريعة
es: Repetir Envío

# tip.snd_6.body
source: Say "repeat last send" to quickly redo your previous transaction.
ar: قل "كرر آخر إرسال" لإعادة معاملتك السابقة بسرعة.
es: Di "repetir último envío" para rehacer rápidamente tu transacción anterior.

# tip.rcv_1.title
source: Fresh Address
ar: عنوان جديد
es: Dirección Nueva

# tip.rcv_1.body
source: Say "new address" to generate a fresh receiving address for better privacy.
ar: قل "عنوان جديد" لإنشاء عنوان استقبال جديد لخصوصية أفضل.
es: Di "nueva dirección" para generar una dirección nueva para mayor privacidad.

# tip.rcv_2.title
source: Amount in QR
ar: مبلغ في QR
es: Monto en QR

# tip.rcv_2.body
source: Try: "receive 0.005 BTC" to create a QR code with a specific amount embedded.
ar: جرّب: "استقبال 0.005 BTC" لإنشاء رمز QR بمبلغ محدد.
es: Prueba: "recibir 0.005 BTC" para crear un código QR con un monto específico.

# tip.rcv_3.title
source: Share Your Address
ar: شارك عنوانك
es: Comparte Tu Dirección

# tip.rcv_3.body
source: Say "share address" to quickly send your receiving address to someone.
ar: قل "شارك العنوان" لإرسال عنوان الاستقبال بسرعة.
es: Di "compartir dirección" para enviar rápidamente tu dirección a alguien.

# tip.rcv_4.title
source: Scan a QR
ar: امسح QR
es: Escanear QR

# tip.rcv_4.body
source: Say "scan QR" to open the camera and scan someone's Bitcoin address.
ar: قل "امسح QR" لفتح الكاميرا ومسح عنوان بتكوين.
es: Di "escanear QR" para abrir la cámara y escanear una dirección Bitcoin.

# tip.rcv_5.title
source: Payment Request
ar: طلب دفع
es: Solicitud de Pago

# tip.rcv_5.body
source: Try: "request 0.005 BTC for dinner" to create a payment request with a note.
ar: جرّب: "اطلب 0.005 BTC للعشاء" لإنشاء طلب دفع مع ملاحظة.
es: Prueba: "solicitar 0.005 BTC por cena" para crear una solicitud de pago con nota.

# tip.bal_1.title
source: Privacy Mode
ar: وضع الخصوصية
es: Modo Privacidad

# tip.bal_1.body
source: Say "hide balance" to mask your amounts with •••••• when in public.
ar: قل "اخفِ الرصيد" لإخفاء المبالغ بـ •••••• في الأماكن العامة.
es: Di "ocultar saldo" para enmascarar tus montos con •••••• en público.

# tip.bal_2.title
source: View UTXOs
ar: عرض UTXOs
es: Ver UTXOs

# tip.bal_2.body
source: Say "show UTXOs" to see all your individual unspent outputs.
ar: قل "اعرض UTXOs" لرؤية جميع المخرجات غير المنفقة.
es: Di "mostrar UTXOs" para ver todas tus salidas no gastadas individuales.

# tip.bal_3.title
source: Balance in Sats
ar: الرصيد بالساتوشي
es: Saldo en Sats

# tip.bal_3.body
source: Try: "balance in sats" to see your balance denominated in satoshis.
ar: جرّب: "الرصيد بالساتوشي" لرؤية رصيدك بالساتوشي.
es: Prueba: "saldo en sats" para ver tu saldo denominado en satoshis.

# tip.bal_4.title
source: Balance in Other Currencies
ar: الرصيد بعملات أخرى
es: Saldo en Otras Monedas

# tip.bal_4.body
source: Try: "balance in EUR" to see your balance in euros or any other currency.
ar: جرّب: "الرصيد باليورو" لرؤية رصيدك بعملة أخرى.
es: Prueba: "saldo en EUR" para ver tu saldo en euros o cualquier otra moneda.

# tip.bal_5.title
source: Quick Refresh
ar: تحديث سريع
es: Actualización Rápida

# tip.bal_5.body
source: Say "refresh" to sync your wallet with the latest blockchain data.
ar: قل "تحديث" لمزامنة محفظتك مع أحدث بيانات البلوكتشين.
es: Di "actualizar" para sincronizar tu billetera con los últimos datos de la blockchain.

# tip.bal_6.title
source: Consolidate
ar: دمج
es: Consolidar

# tip.bal_6.body
source: Say "consolidate UTXOs" to merge small outputs and save on future fees.
ar: قل "دمج UTXOs" لدمج المخرجات الصغيرة وتوفير الرسوم المستقبلية.
es: Di "consolidar UTXOs" para fusionar salidas pequeñas y ahorrar en comisiones futuras.

# tip.hst_1.title
source: Filter History
ar: فلتر السجل
es: Filtrar Historial

# tip.hst_1.body
source: Try: "show sent" or "show received" to filter your transaction history.
ar: جرّب: "اعرض المرسل" أو "اعرض المستلم" لفلترة سجل المعاملات.
es: Prueba: "mostrar enviados" o "mostrar recibidos" para filtrar tu historial.

# tip.hst_2.title
source: More Transactions
ar: معاملات أكثر
es: Más Transacciones

# tip.hst_2.body
source: Try: "last 20 transactions" to see more history at once.
ar: جرّب: "آخر ٢٠ معاملة" لرؤية المزيد من السجل.
es: Prueba: "últimas 20 transacciones" para ver más historial de una vez.

# tip.hst_3.title
source: Pending Transactions
ar: المعاملات المعلقة
es: Transacciones Pendientes

# tip.hst_3.body
source: Say "pending" to see only your unconfirmed transactions.
ar: قل "معلقة" لرؤية المعاملات غير المؤكدة فقط.
es: Di "pendientes" para ver solo tus transacciones sin confirmar.

# tip.hst_4.title
source: Transaction Details
ar: تفاصيل المعاملة
es: Detalles de Transacción

# tip.hst_4.body
source: Paste any transaction ID and I'll show you the full details automatically.
ar: الصق أي معرّف معاملة وسأعرض لك التفاصيل الكاملة تلقائياً.
es: Pega cualquier ID de transacción y te mostraré los detalles automáticamente.

# tip.hst_5.title
source: Export History
ar: تصدير السجل
es: Exportar Historial

# tip.hst_5.body
source: Say "export history" to download a CSV file of all your transactions.
ar: قل "تصدير السجل" لتحميل ملف CSV بجميع معاملاتك.
es: Di "exportar historial" para descargar un archivo CSV de todas tus transacciones.

# tip.hst_6.title
source: First Transaction
ar: أول معاملة
es: Primera Transacción

# tip.hst_6.body
source: Try: "first transaction" to see your wallet's very first activity.
ar: جرّب: "أول معاملة" لرؤية أول نشاط في محفظتك.
es: Prueba: "primera transacción" para ver la primera actividad de tu billetera.

# tip.fee_1.title
source: Check Fees First
ar: تحقق من الرسوم أولاً
es: Revisa Comisiones Primero

# tip.fee_1.body
source: Say "fees" before sending to see current network fee estimates.
ar: قل "رسوم" قبل الإرسال لمعرفة تقديرات رسوم الشبكة الحالية.
es: Di "comisiones" antes de enviar para ver las estimaciones de comisiones actuales.

# tip.fee_2.title
source: Fee Alerts
ar: تنبيهات الرسوم
es: Alertas de Comisiones

# tip.fee_2.body
source: Try: "alert me when fees drop below 2 sat/vB" to get notified.
ar: جرّب: "نبهني عندما تنخفض الرسوم عن 2 sat/vB" للإشعار.
es: Prueba: "avisarme cuando las comisiones bajen de 2 sat/vB" para recibir notificación.

# tip.fee_3.title
source: Bump a Stuck TX
ar: تسريع معاملة عالقة
es: Acelerar TX Atascada

# tip.fee_3.body
source: Say "bump fee" if your transaction is stuck to speed it up with RBF.
ar: قل "رفع الرسوم" إذا كانت معاملتك عالقة لتسريعها عبر RBF.
es: Di "subir comisión" si tu transacción está atascada para acelerarla con RBF.

# tip.fee_4.title
source: Custom Fee
ar: رسوم مخصصة
es: Comisión Personalizada

# tip.fee_4.body
source: Try: "set fee to 5 sat/vB" when sending to set a specific fee rate.
ar: جرّب: "اضبط الرسوم على 5 sat/vB" عند الإرسال لتحديد معدل رسوم معين.
es: Prueba: "fijar comisión a 5 sat/vB" al enviar para establecer una tarifa específica.

# tip.fee_5.title
source: Mempool Status
ar: حالة الميمبول
es: Estado del Mempool

# tip.fee_5.body
source: Say "mempool status" to check current network congestion levels.
ar: قل "حالة الميمبول" للتحقق من مستويات ازدحام الشبكة الحالية.
es: Di "estado del mempool" para verificar los niveles de congestión de la red.

# tip.set_1.title
source: Switch Theme
ar: تغيير المظهر
es: Cambiar Tema

# tip.set_1.body
source: Say "dark mode", "light mode", or "system theme" to change instantly.
ar: قل "الوضع الداكن" أو "الوضع الفاتح" أو "مظهر النظام" للتغيير فوراً.
es: Di "modo oscuro", "modo claro" o "tema del sistema" para cambiar al instante.

# tip.set_2.title
source: Change Language
ar: تغيير اللغة
es: Cambiar Idioma

# tip.set_2.body
source: Say "switch to Arabic" or "switch to Spanish" to change the app language.
ar: قل "غيّر للعربية" أو "غيّر للإسبانية" لتغيير لغة التطبيق.
es: Di "cambiar a árabe" o "cambiar a inglés" para cambiar el idioma de la app.

# tip.set_3.title
source: Display Currency
ar: عملة العرض
es: Moneda de Visualización

# tip.set_3.body
source: Say "show in EUR" to change your default display currency.
ar: قل "اعرض باليورو" لتغيير عملة العرض الافتراضية.
es: Di "mostrar en EUR" para cambiar tu moneda de visualización predeterminada.

# tip.set_4.title
source: Show in Sats
ar: اعرض بالساتوشي
es: Mostrar en Sats

# tip.set_4.body
source: Say "show in sats" to display all amounts in satoshis instead of BTC.
ar: قل "اعرض بالساتوشي" لعرض جميع المبالغ بالساتوشي بدل BTC.
es: Di "mostrar en sats" para ver todos los montos en satoshis en lugar de BTC.

# tip.set_5.title
source: Open Settings
ar: افتح الإعدادات
es: Abrir Ajustes

# tip.set_5.body
source: Say "settings" to open the full settings panel.
ar: قل "الإعدادات" لفتح لوحة الإعدادات الكاملة.
es: Di "ajustes" para abrir el panel completo de configuración.

# tip.sec_1.title
source: Health Check
ar: فحص صحة المحفظة
es: Chequeo de Salud

# tip.sec_1.body
source: Say "health check" to run a full security audit of your wallet.
ar: قل "فحص الصحة" لإجراء تدقيق أمني شامل لمحفظتك.
es: Di "chequeo de salud" para ejecutar una auditoría de seguridad completa de tu billetera.

# tip.sec_2.title
source: Backup Seed
ar: نسخ احتياطي
es: Respaldar Semilla

# tip.sec_2.body
source: Say "backup seed" to securely view your 12-word recovery phrase.
ar: قل "نسخ البذرة" لعرض عبارة الاسترداد المكونة من ١٢ كلمة بأمان.
es: Di "respaldar semilla" para ver de forma segura tu frase de recuperación de 12 palabras.

# tip.sec_3.title
source: Enable Face ID
ar: تفعيل Face ID
es: Activar Face ID

# tip.sec_3.body
source: Say "enable Face ID" to add biometric protection for transactions.
ar: قل "فعّل Face ID" لإضافة حماية بيومترية للمعاملات.
es: Di "activar Face ID" para añadir protección biométrica a las transacciones.

# tip.sec_4.title
source: Lock Wallet
ar: قفل المحفظة
es: Bloquear Billetera

# tip.sec_4.body
source: Say "lock" to immediately lock your wallet and require authentication.
ar: قل "قفل" لقفل محفظتك فوراً وطلب المصادقة.
es: Di "bloquear" para bloquear inmediatamente tu billetera y requerir autenticación.

# tip.sec_5.title
source: Auto-Lock Timer
ar: مؤقت القفل التلقائي
es: Temporizador de Auto-Bloqueo

# tip.sec_5.body
source: Say "lock after 1 minute" to change the auto-lock timer.
ar: قل "اقفل بعد دقيقة" لتغيير مؤقت القفل التلقائي.
es: Di "bloquear después de 1 minuto" para cambiar el temporizador de auto-bloqueo.

# tip.sec_6.title
source: Sign a Message
ar: وقّع رسالة
es: Firmar un Mensaje

# tip.sec_6.body
source: Say "sign message" to cryptographically prove you own an address.
ar: قل "وقّع رسالة" لإثبات ملكيتك لعنوان بالتشفير.
es: Di "firmar mensaje" para probar criptográficamente que posees una dirección.

# tip.anl_1.title
source: Spending Summary
ar: ملخص الإنفاق
es: Resumen de Gastos

# tip.anl_1.body
source: Say "spent this month" for a full spending breakdown.
ar: قل "مصاريف هالشهر" لعرض تفصيل كامل للإنفاق.
es: Di "gastado este mes" para un desglose completo de gastos.

# tip.anl_2.title
source: Income Tracking
ar: تتبع الدخل
es: Seguimiento de Ingresos

# tip.anl_2.body
source: Try: "how much did I receive this year" to see your total incoming BTC.
ar: جرّب: "كم استلمت هذه السنة" لرؤية إجمالي BTC الوارد.
es: Prueba: "cuánto recibí este año" para ver tu BTC entrante total.

# tip.anl_3.title
source: Biggest Transaction
ar: أكبر معاملة
es: Transacción Más Grande

# tip.anl_3.body
source: Try: "biggest transaction" to find your largest send or receive.
ar: جرّب: "أكبر معاملة" لإيجاد أكبر إرسال أو استقبال.
es: Prueba: "transacción más grande" para encontrar tu envío o recepción más grande.

# tip.anl_4.title
source: Total Fees Paid
ar: إجمالي الرسوم المدفوعة
es: Total en Comisiones

# tip.anl_4.body
source: Say "total fees paid" to see how much you've spent on network fees.
ar: قل "إجمالي الرسوم المدفوعة" لمعرفة كم أنفقت على رسوم الشبكة.
es: Di "total pagado en comisiones" para ver cuánto has gastado en comisiones de red.

# tip.anl_5.title
source: Average Transaction
ar: متوسط المعاملة
es: Transacción Promedio

# tip.anl_5.body
source: Try: "average transaction" to see your typical send/receive amount.
ar: جرّب: "متوسط المعاملة" لمعرفة مبلغ الإرسال/الاستقبال المعتاد.
es: Prueba: "transacción promedio" para ver tu monto típico de envío/recepción.

# tip.cal_1.title
source: Sats Converter
ar: محول ساتوشي
es: Conversor de Sats

# tip.cal_1.body
source: Try: "how many sats is 0.001 BTC" for a quick conversion.
ar: جرّب: "كم sats في 0.001 BTC" لتحويل سريع.
es: Prueba: "cuántos sats son 0.001 BTC" para una conversión rápida.

# tip.cal_2.title
source: Currency Conversion
ar: تحويل العملات
es: Conversión de Moneda

# tip.cal_2.body
source: Try: "convert 100 EUR to BTC" for instant currency conversion.
ar: جرّب: "حوّل 100 يورو الى BTC" لتحويل عملات فوري.
es: Prueba: "convertir 100 EUR a BTC" para conversión instantánea de moneda.

# tip.cal_3.title
source: Dust Check
ar: فحص الغبار
es: Verificar Polvo

# tip.cal_3.body
source: Try: "is 500 sats too small to send" to check if an amount is dust.
ar: جرّب: "هل 500 sats قليلة جداً للإرسال" للتحقق من حد الغبار.
es: Prueba: "¿es 500 sats muy poco para enviar?" para verificar si un monto es polvo.

# tip.cal_4.title
source: Fee Calculator
ar: حاسبة الرسوم
es: Calculadora de Comisiones

# tip.cal_4.body
source: Say "fee calculator" to estimate the cost of a transaction before sending.
ar: قل "حاسبة الرسوم" لتقدير تكلفة المعاملة قبل الإرسال.
es: Di "calculadora de comisiones" para estimar el costo de una transacción antes de enviar.

# tip.prc_1.title
source: BTC Price
ar: سعر BTC
es: Precio de BTC

# tip.prc_1.body
source: Say "BTC price" to see the current rate in your default currency.
ar: قل "سعر BTC" لرؤية السعر الحالي بعملتك الافتراضية.
es: Di "precio de BTC" para ver la tasa actual en tu moneda predeterminada.

# tip.prc_2.title
source: Convert to BTC
ar: حوّل الى BTC
es: Convertir a BTC

# tip.prc_2.body
source: Try: "convert $500 to BTC" to see how much Bitcoin you can buy.
ar: جرّب: "حوّل ٥٠٠ دولار الى BTC" لمعرفة كم بتكوين يمكنك شراؤه.
es: Prueba: "convertir $500 a BTC" para ver cuánto Bitcoin puedes comprar.

# tip.prc_3.title
source: Price in Any Currency
ar: السعر بأي عملة
es: Precio en Cualquier Moneda

# tip.prc_3.body
source: Try: "price in EUR" or "price in JPY" to see BTC in other currencies.
ar: جرّب: "السعر باليورو" أو "السعر بالين" لرؤية BTC بعملات أخرى.
es: Prueba: "precio en EUR" o "precio en JPY" para ver BTC en otras monedas.
