Repository: devdasx/Aura-Wallet
Catalog: BitcoinAIWallet/Localization/*.lproj/Localizable.strings
Languages: ar, es

# common.app_name
source: Bitcoin AI Wallet
ar: محفظة بيتكوين الذكية

# common.ok
source: OK
ar: حسناً
es: Aceptar

# common.cancel
source: Cancel
ar: إلغاء
es: Cancelar

# common.confirm
source: Confirm
ar: تأكيد
es: Confirmar

# common.done
source: Done
ar: تم
es: Listo

# common.next
source: Next
ar: التالي
es: Siguiente

# common.back
source: Back
ar: رجوع
es: Atrás

# common.close
source: Close
ar: إغلاق
es: Cerrar

# common.save
source: Save
ar: حفظ
es: Guardar

# common.delete
source: Delete
ar: حذف
es: Eliminar

# common.copy
source: Copy
ar: نسخ
es: Copiar

# common.share
source: Share
ar: مشاركة
es: Compartir

# common.retry
source: Retry
ar: إعادة المحاولة
es: Reintentar

# common.loading
source: Loading...
ar: جارٍ التحميل...
es: Cargando...

# common.error
source: Error
ar: خطأ

# common.success
source: Success
ar: نجاح
es: Éxito

# common.copied
source: Copied to clipboard
ar: تم النسخ إلى الحافظة
es: Copiado al portapapeles

# common.bitcoin
source: Bitcoin
ar: بيتكوين

# common.sats
source: sats
ar: ساتوشي

# common.mainnet
source: Mainnet
ar: الشبكة الرئيسية
es: Red principal

# common.testnet
source: Testnet
ar: شبكة الاختبار
es: Red de prueba

# onboarding.welcome_title
source: Welcome to Bitcoin AI Wallet
ar: مرحباً بك في محفظة بيتكوين الذكية
es: Bienvenido a Bitcoin AI Wallet

# onboarding.welcome_subtitle
source: Your intelligent, self-custodial Bitcoin wallet powered by AI
ar: محفظتك الذكية ذاتية الحفظ للبيتكوين مدعومة بالذكاء الاصطناعي
es: Tu billetera inteligente de Bitcoin con custodia propia, impulsada por inteligencia artificial

# onboarding.create_wallet
source: Create New Wallet
ar: إنشاء محفظة جديدة
es: Crear nueva billetera

# onboarding.import_wallet
source: Import Existing Wallet
ar: استيراد محفظة موجودة
es: Importar billetera existente

# onboarding.seed_phrase_title
source: Your Recovery Phrase
ar: عبارة الاسترداد الخاصة بك
es: Tu frase de recuperación

# onboarding.seed_phrase_warning
source: Write down these 12 words in order and store them in a safe place. Never share your recovery phrase with anyone. Anyone with this phrase can access your funds.
ar: اكتب هذه الكلمات الـ 12 بالترتيب واحفظها في مكان آمن. لا تشارك عبارة الاسترداد مع أي شخص أبداً. أي شخص يمتلك هذه العبارة يمكنه الوصول إلى أموالك.
es: Escribe estas 12 palabras en orden y guárdalas en un lugar seguro. Nunca compartas tu frase de recuperación con nadie. Cualquier persona con esta frase puede acceder a tus fondos.

# onboarding.seed_phrase_instruction
source: Write down each word carefully in the correct order. You will need to verify them on the next screen.
ar: اكتب كل كلمة بعناية وبالترتيب الصحيح. ستحتاج إلى التحقق منها في الشاشة التالية.
es: Escribe cada palabra cuidadosamente en el orden correcto. Necesitarás verificarlas en la siguiente pantalla.

# onboarding.seed_verify_title
source: Verify Recovery Phrase
ar: التحقق من عبارة الاسترداد
es: Verificar frase de recuperación

# onboarding.seed_verify_instruction
source: Tap the words in the correct order to verify you have saved your recovery phrase.
ar: اضغط على الكلمات بالترتيب الصحيح للتحقق من أنك حفظت عبارة الاسترداد.
es: Toca las palabras en el orden correcto para verificar que has guardado tu frase de recuperación.

# onboarding.import_title
source: Import Wallet
ar: استيراد المحفظة
es: Importar billetera

# onboarding.import_instruction
source: Enter your 12-word recovery phrase to restore your wallet. Separate each word with a space.
ar: أدخل عبارة الاسترداد المكونة من 12 كلمة لاستعادة محفظتك. افصل بين كل كلمة بمسافة.
es: Ingresa tu frase de recuperación de 12 palabras para restaurar tu billetera. Separa cada palabra con un espacio.

# onboarding.import_placeholder
source: Enter your 12-word recovery phrase...
ar: أدخل عبارة الاسترداد المكونة من 12 كلمة...
es: Ingresa tu frase de recuperación de 12 palabras...

# onboarding.set_passcode_title
source: Set Passcode
ar: تعيين رمز المرور
es: Establecer código de acceso

# onboarding.set_passcode_subtitle
source: Create a 6-digit passcode to secure your wallet
ar: أنشئ رمز مرور مكون من 6 أرقام لتأمين محفظتك
es: Crea un código de acceso de 6 dígitos para proteger tu billetera

# onboarding.enable_biometrics
source: Enable Biometric Authentication
ar: تفعيل المصادقة البيومترية
es: Activar autenticación biométrica

# onboarding.setup_complete
source: Wallet Setup Complete!
ar: اكتمل إعداد المحفظة!
es: ¡Configuración de billetera completada!

# onboarding.i_saved_it
source: I Saved My Recovery Phrase
ar: لقد حفظت عبارة الاسترداد
es: He guardado mi frase de recuperación

# onboarding.word_number
source: Word #%d
ar: الكلمة #%d
es: Palabra #%d

# wallet.main_wallet
source: Main Wallet
ar: المحفظة الرئيسية
es: Billetera principal

# wallet.balance
source: Balance
ar: الرصيد
es: Saldo

# wallet.total_balance
source: Total Balance
ar: الرصيد الإجمالي
es: Saldo total

# wallet.available_balance
source: Available Balance
ar: الرصيد المتاح
es: Saldo disponible

# wallet.pending_balance
source: Pending Balance
ar: الرصيد المعلق
es: Saldo pendiente

# wallet.utxo_count
source: UTXOs
ar: مخرجات غير منفقة

# wallet.last_updated
source: Last Updated
ar: آخر تحديث
es: Última actualización

# wallet.refreshing
source: Refreshing...
ar: جارٍ التحديث...
es: Actualizando...

# chat.input_placeholder
source: Ask me anything about Bitcoin...
ar: اسألني أي شيء عن البيتكوين...
es: Pregúntame lo que quieras sobre Bitcoin...

# chat.greeting
source: Hey! I'm your **Bitcoin AI** assistant. I can help you **send** and **receive** Bitcoin, check your **balance**, and answer questions. What would you like to do?
ar: مرحباً! أنا مساعدك الذكي للبيتكوين. يمكنني مساعدتك في إرسال واستقبال البيتكوين، والتحقق من رصيدك، والإجابة على أسئلتك. كيف يمكنني المساعدة؟
es: ¡Hola! Soy tu asistente inteligente de Bitcoin. Puedo ayudarte a enviar y recibir Bitcoin, consultar tu saldo y responder preguntas. ¿En qué puedo ayudarte?

# chat.wallet_ai
source: Wallet AI
ar: الذكاء الاصطناعي للمحفظة
es: IA de Billetera

# chat.thinking
source: Thinking...
ar: جارٍ التفكير...
es: Pensando...

# chat.today
source: Today
ar: اليوم
es: Hoy

# chat.yesterday
source: Yesterday
ar: أمس
es: Ayer

# chat.send_confirm_prompt
source: Ready to send? Review the details below and **confirm** when ready.
ar: سأرسل %@ BTC إلى %@. رسوم الشبكة تقريباً %@ ساتوشي. هل تريد التأكيد؟
es: Enviaré %@ BTC a %@. La comisión de red es aproximadamente %@ sats. ¿Deseas confirmar?

# chat.send_success
source: Transaction sent successfully!
ar: تم إرسال المعاملة بنجاح! معرّف المعاملة هو %@.
es: ¡Transacción enviada con éxito! Tu identificador de transacción es %@.

# chat.send_failed
source: Transaction failed. Please try again or check your connection.
ar: فشلت المعاملة. يرجى المحاولة مرة أخرى أو التحقق من اتصالك.
es: La transacción falló. Por favor, inténtalo de nuevo o verifica tu conexión.

# chat.receive_prompt
source: Here is your **Bitcoin** receiving address. Share it or scan the QR code.
ar: إليك عنوان استقبال البيتكوين الخاص بك. يمكنك مشاركته أو مسح رمز QR.
es: Aquí está tu dirección de recepción de Bitcoin. Puedes compartirla o escanear el código QR.

# chat.balance_response
source: Here's your current balance:
ar: رصيدك الحالي هو %@ BTC (تقريباً %@ دولار أمريكي).
es: Tu saldo actual es %@ BTC (aproximadamente %@ USD).

# chat.history_response
source: Here are your recent transactions:
ar: إليك معاملاتك الأخيرة:
es: Aquí están tus transacciones recientes:

# chat.unknown_command
source: I'm not sure I understand. Try asking about your **balance**, **sending** Bitcoin, or **receiving** Bitcoin.
ar: لست متأكداً أنني أفهم. جرّب السؤال عن رصيدك، أو إرسال البيتكوين، أو استقبال البيتكوين.
es: No estoy seguro de entender. Intenta preguntar sobre tu saldo, enviar Bitcoin o recibir Bitcoin.

# chat.insufficient_funds
source: Insufficient funds for this transaction.
ar: ليس لديك رصيد كافٍ لهذه المعاملة. رصيدك المتاح هو %@ BTC.
es: No tienes fondos suficientes para esta transacción. Tu saldo disponible es %@ BTC.

# chat.invalid_address
source: That doesn't look like a valid Bitcoin address. Please check and try again.
ar: لا يبدو هذا عنوان بيتكوين صالحاً. يرجى التحقق والمحاولة مرة أخرى.
es: Eso no parece una dirección de Bitcoin válida. Por favor, verifica e intenta de nuevo.

# chat.fee_estimate
source: Current network fees:
ar: الرسوم المقدرة الحالية: منخفض %@ sat/vB، متوسط %@ sat/vB، مرتفع %@ sat/vB.
es: Comisiones estimadas actuales: Baja %@ sat/vB, Media %@ sat/vB, Alta %@ sat/vB.

# chat.pending_notice
source: Pending transaction awaiting confirmation.
ar: لديك %d معاملة معلقة في انتظار التأكيد.
es: Tienes %d transacción(es) pendiente(s) esperando confirmación.

# chat.confirmed_notice
source: Transaction confirmed.
ar: تم تأكيد معاملتك بـ %d تأكيد(ات).
es: Tu transacción ha sido confirmada con %d confirmación(es).

# chat.taproot_note
source: Taproot (bc1p) address — enhanced privacy and lower fees.
ar: هذا عنوان Taproot (bc1p)، يوفر خصوصية محسنة ورسوماً أقل.
es: Esta es una dirección Taproot (bc1p), que ofrece mayor privacidad y comisiones más bajas.

# chat.new_address_note
source: A new address has been generated for improved privacy.
ar: تم إنشاء عنوان استقبال جديد لتحسين الخصوصية.
es: Se ha generado una nueva dirección de recepción para mejorar la privacidad.

# chat.net_flow_summary
source: Net flow: %@ BTC received, %@ BTC sent over the last %d transactions.
ar: صافي التدفق: %@ BTC مستلم، %@ BTC مرسل خلال آخر %d معاملة.
es: Flujo neto: %@ BTC recibidos, %@ BTC enviados en las últimas %d transacciones.

# send.title
source: Send Bitcoin
ar: إرسال بيتكوين
es: Enviar Bitcoin

# send.amount
source: Amount
ar: المبلغ
es: Cantidad

# send.to
source: To
ar: إلى
es: Para

# send.from
source: From
ar: من
es: Desde

# send.network_fee
source: Network Fee
ar: رسوم الشبكة
es: Comisión de red

# send.estimated_time
source: Estimated Time
ar: الوقت المقدر
es: Tiempo estimado

# send.remaining
source: Remaining Balance
ar: الرصيد المتبقي
es: Saldo restante

# send.total
source: Total
ar: الإجمالي

# send.confirm_and_sign
source: Confirm & Sign
ar: تأكيد وتوقيع
es: Confirmar y firmar

# send.change_fee
source: Change Fee
ar: تغيير الرسوم
es: Cambiar comisión

# send.review
source: Review Transaction
ar: مراجعة المعاملة
es: Revisar transacción

# send.signing
source: Signing transaction...
ar: جارٍ توقيع المعاملة...
es: Firmando transacción...

# send.broadcasting
source: Broadcasting transaction...
ar: جارٍ بث المعاملة...
es: Transmitiendo transacción...

# send.usd_equivalent
source: USD Equivalent
ar: المعادل بالدولار
es: Equivalente en USD

# send.minutes
source: minutes
ar: دقائق
es: minutos

# receive.title
source: Receive Bitcoin
ar: استقبال بيتكوين
es: Recibir Bitcoin

# receive.your_address
source: Your Address
ar: عنوانك
es: Tu dirección

# receive.scan_qr
source: Scan QR Code
ar: مسح رمز QR
es: Escanear código QR

# receive.address_copied
source: Address copied to clipboard
ar: تم نسخ العنوان إلى الحافظة
es: Dirección copiada al portapapeles

# receive.share_address
source: Share Address
ar: مشاركة العنوان
es: Compartir dirección

# receive.new_address
source: Generate New Address
ar: إنشاء عنوان جديد
es: Generar nueva dirección

# receive.address_type
source: Address Type
ar: نوع العنوان
es: Tipo de dirección

# history.title
source: Transaction History
ar: سجل المعاملات
es: Historial de transacciones

# history.recent_transactions
source: Recent Transactions
ar: المعاملات الأخيرة
es: Transacciones recientes

# history.sent
source: Sent
ar: مُرسل
es: Enviado

# history.received
source: Received
ar: مُستلم
es: Recibido

# history.pending
source: Pending
ar: معلق
es: Pendiente

# history.confirmed
source: Confirmed
ar: مؤكد
es: Confirmado

# history.confirmations
source: Confirmations
ar: التأكيدات
es: Confirmaciones

# history.no_transactions
source: No transactions yet
ar: لا توجد معاملات بعد
es: No hay transacciones todavía

# history.view_on_explorer
source: View on Explorer
ar: عرض في المستكشف
es: Ver en el explorador

# history.transaction_sent
source: Transaction Sent
ar: تم إرسال المعاملة
es: Transacción enviada

# history.txid
source: Transaction ID
ar: معرّف المعاملة
es: ID de transacción

# fee.title
source: Network Fee
ar: رسوم الشبكة
es: Comisión de red

# fee.slow
source: Slow
ar: بطيء
es: Lenta

# fee.medium
source: Medium
ar: متوسط
es: Media

# fee.fast
source: Fast
ar: سريع
es: Rápida

# fee.custom
source: Custom
ar: مخصص
es: Personalizada

# fee.slow_time
source: ~60 minutes
ar: ~٦٠ دقيقة
es: ~60 minutos

# fee.medium_time
source: ~30 minutes
ar: ~٣٠ دقيقة
es: ~30 minutos

# fee.fast_time
source: ~10 minutes
ar: ~١٠ دقائق
es: ~10 minutos

# quick_action.send
source: Send
ar: إرسال
es: Enviar

# quick_action.receive
source: Receive
ar: استقبال
es: Recibir

# quick_action.history
source: History
ar: السجل
es: Historial

# quick_action.fees
source: Fees
ar: الرسوم
es: Comisiones

# quick_action.settings
source: Settings
ar: الإعدادات
es: Ajustes

# settings.title
source: Settings
ar: الإعدادات
es: Ajustes

# settings.general
source: General
ar: عام

# settings.security
source: Security
ar: الأمان
es: Seguridad

# settings.network
source: Network
ar: الشبكة
es: Red

# settings.about
source: About
ar: حول التطبيق
es: Acerca de

# settings.currency
source: Currency
ar: العملة
es: Moneda

# settings.theme
source: Theme
ar: المظهر
es: Tema

# settings.dark_mode
source: Dark Mode
ar: الوضع الداكن
es: Modo oscuro

# settings.light_mode
source: Light Mode
ar: الوضع الفاتح
es: Modo claro

# settings.system_mode
source: System
ar: وضع النظام
es: Sistema

# settings.language
source: Language
ar: اللغة
es: Idioma

# settings.change_passcode
source: Change Passcode
ar: تغيير رمز المرور
es: Cambiar código de acceso

# settings.biometrics
source: Biometric Authentication
ar: المصادقة البيومترية
es: Autenticación biométrica

# settings.backup_wallet
source: Backup Wallet
ar: نسخ المحفظة احتياطياً
es: Respaldar billetera

# settings.blockbook_server
source: Blockbook Server
ar: خادم Blockbook
es: Servidor Blockbook

# settings.ankr_endpoint
source: Ankr Endpoint
ar: نقطة اتصال Ankr
es: Punto de acceso Ankr

# settings.network_status
source: Network Status
ar: حالة الشبكة
es: Estado de la red

# settings.version
source: Version
ar: الإصدار
es: Versión

# settings.delete_wallet
source: Delete Wallet
ar: حذف المحفظة
es: Eliminar billetera

# settings.delete_wallet_warning
source: This will permanently delete your wallet and all associated data. Make sure you have backed up your recovery phrase before proceeding. This action cannot be undone.
ar: سيتم حذف محفظتك وجميع البيانات المرتبطة بها نهائياً. تأكد من أنك قمت بنسخ عبارة الاسترداد احتياطياً قبل المتابعة. لا يمكن التراجع عن هذا الإجراء.
es: Esto eliminará permanentemente tu billetera y todos los datos asociados. Asegúrate de haber respaldado tu frase de recuperación antes de continuar. Esta acción no se puede deshacer.

# settings.connected
source: Connected
ar: متصل
es: Conectado

# settings.disconnected
source: Disconnected
ar: غير متصل
es: Desconectado

# settings.server_configuration
source: Server Configuration
ar: إعدادات الخادم
es: Configuración del servidor

# settings.test_connection
source: Test
ar: اختبار
es: Probar

# settings.connection_success
source: Connection successful
ar: تم الاتصال بنجاح
es: Conexión exitosa

# settings.invalid_url
source: Invalid URL format. Must start with https://
ar: صيغة الرابط غير صالحة. يجب أن يبدأ بـ https://
es: Formato de URL inválido. Debe comenzar con https://

# settings.connection_info
source: Connection Info
ar: معلومات الاتصال
es: Información de conexión

# settings.connection_type
source: Connection Type
ar: نوع الاتصال
es: Tipo de conexión

# settings.current_server
source: Current Server
ar: الخادم الحالي
es: Servidor actual

# settings.network_quality
source: Network Quality
ar: جودة الشبكة
es: Calidad de red

# settings.expensive_connection
source: Metered Connection
ar: اتصال محدود
es: Conexión limitada

# settings.low_data_mode
source: Low Data Mode
ar: وضع البيانات المنخفضة
es: Modo de datos reducidos

# settings.active
source: Active
ar: نشط
es: Activo

# settings.enabled
source: Enabled
ar: مفعّل
es: Activado

# settings.unrestricted_connection
source: Unrestricted Connection
ar: اتصال غير محدود
es: Conexión sin restricciones

# settings.reset_to_default
source: Reset to Default Server
ar: إعادة التعيين إلى الخادم الافتراضي
es: Restablecer servidor predeterminado

# settings.default_server_note
source: Default: btc1.trezor.io
ar: الافتراضي: btc1.trezor.io
es: Predeterminado: btc1.trezor.io

# settings.cellular
source: Cellular
ar: بيانات الهاتف
es: Datos móviles

# settings.wired
source: Wired
ar: سلكي
es: Cableado

# settings.server_error
source: Server returned error
ar: الخادم أرجع خطأ
es: El servidor devolvió un error

# settings.auto_lock
source: Auto-Lock
ar: القفل التلقائي
es: Bloqueo automático

# settings.auto_lock_footer
source: The app will lock after this period of inactivity.
ar: سيتم قفل التطبيق بعد فترة عدم النشاط هذه.
es: La app se bloqueará después de este periodo de inactividad.

# settings.passcode
source: Passcode
ar: رمز المرور
es: Código de acceso

# settings.current_passcode
source: Current Passcode
ar: رمز المرور الحالي
es: Código actual

# settings.new_passcode
source: New Passcode
ar: رمز المرور الجديد
es: Nuevo código

# settings.confirm_new_passcode
source: Confirm New Passcode
ar: تأكيد رمز المرور الجديد
es: Confirmar nuevo código

# settings.passcode_changed
source: Passcode Changed
ar: تم تغيير رمز المرور
es: Código cambiado

# settings.passcode_changed_message
source: Your passcode has been updated successfully.
ar: تم تحديث رمز المرور بنجاح.
es: Tu código de acceso se ha actualizado correctamente.

# settings.biometrics_unavailable
source: Biometrics not available on this device
ar: المصادقة البيومترية غير متاحة على هذا الجهاز
es: Biometría no disponible en este dispositivo

# settings.biometrics_footer
source: Use biometrics to unlock the app and authorize transactions.
ar: استخدم المصادقة البيومترية لفتح التطبيق وتفويض المعاملات.
es: Usa la biometría para desbloquear la app y autorizar transacciones.

# settings.face_id_description
source: Unlock with Face ID
ar: فتح بواسطة Face ID
es: Desbloquear con Face ID

# settings.touch_id_description
source: Unlock with Touch ID
ar: فتح بواسطة Touch ID
es: Desbloquear con Touch ID

# settings.biometric_none_description
source: No biometric sensor available
ar: لا يوجد مستشعر بيومتري متاح
es: No hay sensor biométrico disponible

# settings.passcode_too_short
source: Passcode must be at least 4 digits
ar: يجب أن يكون رمز المرور 4 أرقام على الأقل
es: El código debe tener al menos 4 dígitos

# settings.current_passcode_wrong
source: Current passcode is incorrect
ar: رمز المرور الحالي غير صحيح
es: El código actual es incorrecto

# settings.one_minute
source: 1 minute
ar: دقيقة واحدة
es: 1 minuto

# settings.five_minutes
source: 5 minutes
ar: ٥ دقائق
es: 5 minutos

# settings.fifteen_minutes
source: 15 minutes
ar: ١٥ دقيقة
es: 15 minutos

# settings.thirty_minutes
source: 30 minutes
ar: ٣٠ دقيقة
es: 30 minutos

# backup.authenticate_title
source: View Recovery Phrase
ar: عرض عبارة الاسترداد
es: Ver frase de recuperación

# backup.authenticate_subtitle
source: Authenticate to view your 12-word recovery phrase
ar: قم بالمصادقة لعرض عبارة الاسترداد المكونة من 12 كلمة
es: Autentícate para ver tu frase de recuperación de 12 palabras

# backup.authenticate_button
source: Authenticate
ar: مصادقة
es: Autenticar

# backup.never_share
source: Never share your recovery phrase with anyone.
ar: لا تشارك عبارة الاسترداد مع أي شخص أبداً.
es: Nunca compartas tu frase de recuperación con nadie.

# backup.warning_title
source: Recovery Phrase
ar: عبارة الاسترداد
es: Frase de recuperación

# backup.warning_message
source: Write down these 12 words in order and store them safely.
ar: اكتب هذه الكلمات الـ 12 بالترتيب واحفظها بأمان.
es: Escribe estas 12 palabras en orden y guárdalas de forma segura.

# lock_screen.subtitle
source: Your wallet is locked
ar: محفظتك مقفلة
es: Tu billetera está bloqueada

# lock_screen.unlock_button
source: Unlock
ar: فتح القفل
es: Desbloquear

# lock_screen.auth_failed
source: Authentication failed. Please try again.
ar: فشلت المصادقة. يرجى المحاولة مرة أخرى.
es: La autenticación falló. Por favor, intenta de nuevo.

# onboarding.generating_wallet
source: Generating your wallet...
ar: جارٍ إنشاء محفظتك...
es: Generando tu billetera...

# onboarding.confirm_passcode
source: Confirm Passcode
ar: تأكيد رمز المرور
es: Confirmar código de acceso

# onboarding.confirm_passcode_subtitle
source: Re-enter your 6-digit passcode to confirm
ar: أعد إدخال رمز المرور المكون من 6 أرقام للتأكيد
es: Vuelve a ingresar tu código de 6 dígitos para confirmar

# onboarding.passcode_mismatch
source: Passcodes don't match. Please try again.
ar: رموز المرور غير متطابقة. يرجى المحاولة مرة أخرى.
es: Los códigos no coinciden. Por favor, intenta de nuevo.

# onboarding.paste_from_clipboard
source: Paste from Clipboard
ar: لصق من الحافظة
es: Pegar del portapapeles

# onboarding.verification_failed
source: Incorrect order. Please try again.
ar: ترتيب خاطئ. يرجى المحاولة مرة أخرى.
es: Orden incorrecto. Por favor, intenta de nuevo.

# onboarding.enable_biometrics_prompt
source: Enable %@ for quick access?
ar: تفعيل %@ للوصول السريع؟
es: ¿Activar %@ para acceso rápido?

# onboarding.skip_for_now
source: Skip for Now
ar: تخطي الآن
es: Omitir por ahora

# onboarding.wallet_ready
source: Your wallet is ready to use
ar: محفظتك جاهزة للاستخدام
es: Tu billetera está lista para usar

# onboarding.get_started
source: Get Started
ar: ابدأ الآن
es: Comenzar

# onboarding.word_count_format
source: %d/%d words
ar: %d/%d كلمة
es: %d/%d palabras

# onboarding.import_button
source: Import Wallet
ar: استيراد المحفظة
es: Importar billetera

# onboarding.securing_wallet
source: Securing your wallet...
ar: جارٍ تأمين محفظتك...
es: Asegurando tu billetera...

# error.network
source: Network error. Please check your internet connection and try again.
ar: خطأ في الشبكة. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.
es: Error de red. Por favor, verifica tu conexión a internet e intenta de nuevo.

# error.invalid_amount
source: Please enter a valid amount.
ar: يرجى إدخال مبلغ صالح.
es: Por favor, ingresa una cantidad válida.

# error.invalid_address
source: The Bitcoin address entered is not valid.
ar: عنوان البيتكوين المُدخل غير صالح.
es: La dirección de Bitcoin ingresada no es válida.

# error.insufficient_funds
source: Insufficient funds to complete this transaction.
ar: رصيد غير كافٍ لإتمام هذه المعاملة.
es: Fondos insuficientes para completar esta transacción.

# error.transaction_failed
source: Transaction failed. Please try again.
ar: فشلت المعاملة. يرجى المحاولة مرة أخرى.
es: La transacción falló. Por favor, intenta de nuevo.

# error.broadcast_failed
source: Failed to broadcast transaction to the network. Please try again.
ar: فشل بث المعاملة إلى الشبكة. يرجى المحاولة مرة أخرى.
es: No se pudo transmitir la transacción a la red. Por favor, intenta de nuevo.

# error.keychain
source: Keychain error. Unable to access secure storage.
ar: خطأ في سلسلة المفاتيح. تعذر الوصول إلى التخزين الآمن.
es: Error del llavero. No se pudo acceder al almacenamiento seguro.

# error.biometric_failed
source: Biometric authentication failed. Please try again or use your passcode.
ar: فشلت المصادقة البيومترية. يرجى المحاولة مرة أخرى أو استخدام رمز المرور.
es: La autenticación biométrica falló. Por favor, intenta de nuevo o usa tu código de acceso.

# error.wallet_corrupted
source: Wallet data appears to be corrupted. Please restore from your recovery phrase.
ar: يبدو أن بيانات المحفظة تالفة. يرجى الاستعادة باستخدام عبارة الاسترداد.
es: Los datos de la billetera parecen estar dañados. Por favor, restaura desde tu frase de recuperación.
