Repository: devdasx/Aura-Wallet
Catalog: BitcoinAIWallet/Localization/*.lproj/Localizable.strings
Languages: ar, es

# tip.prc_4.title
source: My BTC in Fiat
ar: بتكويني بعملة أخرى
es: Mi BTC en Fiat

# tip.prc_4.body
source: Try: "how much is my BTC in EUR" to see your holdings in another currency.
ar: جرّب: "كم يساوي BTC بالدينار" لرؤية رصيدك بعملة أخرى.
es: Prueba: "cuánto vale mi BTC en EUR" para ver tus fondos en otra moneda.

# tip.net_1.title
source: Change Server
ar: تغيير الخادم
es: Cambiar Servidor

# tip.net_1.body
source: Say "change server" to connect to your own Blockbook node.
ar: قل "غيّر الخادم" للاتصال بعقدة Blockbook خاصة بك.
es: Di "cambiar servidor" para conectarte a tu propio nodo Blockbook.

# tip.net_2.title
source: Test Connection
ar: اختبار الاتصال
es: Probar Conexión

# tip.net_2.body
source: Say "test connection" to check your server's response time.
ar: قل "اختبر الاتصال" للتحقق من وقت استجابة الخادم.
es: Di "probar conexión" para verificar el tiempo de respuesta de tu servidor.

# tip.net_3.title
source: Server Info
ar: معلومات الخادم
es: Info del Servidor

# tip.net_3.body
source: Say "server info" to see details about your current Blockbook connection.
ar: قل "معلومات الخادم" لرؤية تفاصيل اتصال Blockbook الحالي.
es: Di "info del servidor" para ver detalles sobre tu conexión Blockbook actual.

# tip.adr_1.title
source: Validate an Address
ar: تحقق من عنوان
es: Validar una Dirección

# tip.adr_1.body
source: Try pasting any Bitcoin address — I'll tell you what type it is.
ar: الصق أي عنوان بتكوين — سأخبرك بنوعه تلقائياً.
es: Pega cualquier dirección Bitcoin — te diré qué tipo es.

# tip.adr_2.title
source: Address Type Check
ar: فحص نوع العنوان
es: Verificar Tipo de Dirección

# tip.adr_2.body
source: Try: "what type is bc1p..." to identify if it's Legacy, SegWit, or Taproot.
ar: جرّب: "ما نوع bc1p..." لمعرفة إذا كان Legacy أو SegWit أو Taproot.
es: Prueba: "qué tipo es bc1p..." para identificar si es Legacy, SegWit o Taproot.

# tip.adr_3.title
source: Paste to Act
ar: الصق للتنفيذ
es: Pegar para Actuar

# tip.adr_3.body
source: Paste any Bitcoin address and I'll ask what you want to do with it.
ar: الصق أي عنوان بتكوين وسأسألك ماذا تريد أن تفعل به.
es: Pega cualquier dirección Bitcoin y te preguntaré qué quieres hacer con ella.

# tip.shr_1.title
source: Payment Request
ar: طلب دفع
es: Solicitud de Pago

# tip.shr_1.body
source: Say "request 0.005 BTC for dinner" to create a QR with amount and note.
ar: قل "اطلب 0.005 BTC للعشاء" لإنشاء QR بمبلغ وملاحظة.
es: Di "solicitar 0.005 BTC por cena" para crear un QR con monto y nota.

# tip.shr_2.title
source: Share Address
ar: شارك العنوان
es: Compartir Dirección

# tip.shr_2.body
source: Say "share address" to quickly send your receiving address via any app.
ar: قل "شارك العنوان" لإرسال عنوان الاستقبال بسرعة عبر أي تطبيق.
es: Di "compartir dirección" para enviar rápidamente tu dirección por cualquier app.

# tip.shr_3.title
source: Copy Address
ar: انسخ العنوان
es: Copiar Dirección

# tip.shr_3.body
source: Say "copy" after viewing an address to copy it to your clipboard.
ar: قل "انسخ" بعد عرض العنوان لنسخه إلى الحافظة.
es: Di "copiar" después de ver una dirección para copiarla al portapapeles.

# tip.gen_1.title
source: Natural Language
ar: لغة طبيعية
es: Lenguaje Natural

# tip.gen_1.body
source: You don't need exact commands — just describe what you want naturally!
ar: لا تحتاج أوامر محددة — فقط صِف ما تريد بشكل طبيعي!
es: No necesitas comandos exactos — ¡solo describe lo que quieres naturalmente!

# tip.gen_2.title
source: Multilingual
ar: متعدد اللغات
es: Multilingüe

# tip.gen_2.body
source: I understand English, العربية, and Español — talk to me in any language!
ar: أفهم English و العربية و Español — تحدث معي بأي لغة!
es: Entiendo English, العربية y Español — ¡háblame en cualquier idioma!

# tip.gen_3.title
source: Full Command List
ar: قائمة الأوامر الكاملة
es: Lista Completa de Comandos

# tip.gen_3.body
source: Say "help" to see everything I can do for you.
ar: قل "مساعدة" لرؤية كل ما يمكنني فعله لك.
es: Di "ayuda" para ver todo lo que puedo hacer por ti.

# tip.gen_4.title
source: Auto-Detect TXID
ar: كشف TXID تلقائي
es: Auto-Detectar TXID

# tip.gen_4.body
source: Paste a transaction ID and I'll show the details automatically.
ar: الصق معرّف معاملة وسأعرض التفاصيل تلقائياً.
es: Pega un ID de transacción y te mostraré los detalles automáticamente.

# tip.gen_5.title
source: Quick Start
ar: بداية سريعة
es: Inicio Rápido

# tip.gen_5.body
source: Try: "balance", "send", "receive", "price", or "fees" to get started.
ar: جرّب: "الرصيد" أو "ارسل" أو "استقبل" أو "السعر" أو "الرسوم" للبدء.
es: Prueba: "saldo", "enviar", "recibir", "precio" o "comisiones" para empezar.

# tip.edu_1.title
source: Learn More
ar: تعلّم المزيد
es: Aprender Más

# tip.edu_1.body
source: Say "what is mining" to learn how Bitcoin blocks are created.
ar: قل "ما هو التعدين" لتتعلم كيف يتم إنشاء كتل بتكوين.
es: Di "qué es la minería" para aprender cómo se crean los bloques de Bitcoin.

# tip.edu_2.title
source: Explore Concepts
ar: استكشف المفاهيم
es: Explorar Conceptos

# tip.edu_2.body
source: Say "what is the mempool" to learn about unconfirmed transactions.
ar: قل "ما هو الميمبول" لتتعلم عن المعاملات غير المؤكدة.
es: Di "qué es el mempool" para aprender sobre transacciones sin confirmar.

# tip.edu_3.title
source: Understand RBF
ar: افهم RBF
es: Entender RBF

# tip.edu_3.body
source: Say "what is RBF" to learn about Replace-By-Fee for stuck transactions.
ar: قل "ما هو RBF" لتتعلم عن استبدال الرسوم للمعاملات العالقة.
es: Di "qué es RBF" para aprender sobre Replace-By-Fee para transacciones atascadas.

# tip.edu_4.title
source: Address Types
ar: أنواع العناوين
es: Tipos de Dirección

# tip.edu_4.body
source: Say "what is taproot" to learn about the newest address format.
ar: قل "ما هو Taproot" لتتعلم عن أحدث تنسيق للعناوين.
es: Di "qué es taproot" para aprender sobre el formato de dirección más nuevo.

# tip.edu_5.title
source: Learn SegWit
ar: تعلم SegWit
es: Aprender SegWit

# tip.edu_5.body
source: Say "what is segwit" to learn about Segregated Witness and lower fees.
ar: قل "ما هو SegWit" لتتعلم عن Segregated Witness ورسوم أقل.
es: Di "qué es segwit" para aprender sobre Segregated Witness y comisiones más bajas.

# processing.refresh.connecting
source: Connecting to network...
ar: جارٍ الاتصال بالشبكة...
es: Conectando a la red...

# processing.refresh.fetching_balance
source: Fetching balance...
ar: جارٍ جلب الرصيد...
es: Obteniendo saldo...

# processing.refresh.syncing_transactions
source: Syncing transactions...
ar: جارٍ مزامنة المعاملات...
es: Sincronizando transacciones...

# processing.refresh.updating_fees
source: Updating fee estimates...
ar: جارٍ تحديث تقديرات الرسوم...
es: Actualizando tarifas...

# processing.balance.connecting
source: Connecting to network...
ar: جارٍ الاتصال بالشبكة...
es: Conectando a la red...

# processing.balance.fetching_balance
source: Fetching balance...
ar: جارٍ جلب الرصيد...
es: Obteniendo saldo...

# processing.balance.calculating
source: Calculating totals...
ar: جارٍ حساب المجاميع...
es: Calculando totales...

# processing.send.signing
source: Signing transaction...
ar: جارٍ توقيع المعاملة...
es: Firmando transacción...

# processing.send.broadcasting
source: Broadcasting to network...
ar: جارٍ البث إلى الشبكة...
es: Transmitiendo a la red...

# processing.send.confirming
source: Confirming broadcast...
ar: جارٍ تأكيد البث...
es: Confirmando transmisión...

# processing.history.fetching_transactions
source: Fetching transactions...
ar: جارٍ جلب المعاملات...
es: Obteniendo transacciones...

# processing.history.processing_data
source: Processing data...
ar: جارٍ معالجة البيانات...
es: Procesando datos...

# processing.tx_detail.looking_up
source: Looking up transaction...
ar: جارٍ البحث عن المعاملة...
es: Buscando transacción...

# processing.tx_detail.fetching_details
source: Fetching details...
ar: جارٍ جلب التفاصيل...
es: Obteniendo detalles...

# processing.fees.querying_mempool
source: Querying mempool...
ar: جارٍ استعلام الميمبول...
es: Consultando mempool...

# processing.fees.calculating_rates
source: Calculating fee rates...
ar: جارٍ حساب معدلات الرسوم...
es: Calculando tarifas...

# processing.price.fetching
source: Fetching latest price...
ar: جارٍ جلب أحدث سعر...
es: Obteniendo precio actual...

# processing.price.converting
source: Converting currencies...
ar: جارٍ تحويل العملات...
es: Convirtiendo monedas...

# processing.convert.fetching_rate
source: Fetching exchange rate...
ar: جارٍ جلب سعر الصرف...
es: Obteniendo tipo de cambio...

# processing.convert.calculating
source: Calculating conversion...
ar: جارٍ حساب التحويل...
es: Calculando conversión...

# processing.validate.checking_format
source: Checking address format...
ar: جارٍ فحص تنسيق العنوان...
es: Verificando formato...

# processing.validate.validating_checksum
source: Validating checksum...
ar: جارٍ التحقق من المجموع الاختباري...
es: Validando checksum...

# processing.validate.identifying_type
source: Identifying address type...
ar: جارٍ تحديد نوع العنوان...
es: Identificando tipo de dirección...

# processing.health.checking_keychain
source: Checking keychain...
ar: جارٍ فحص سلسلة المفاتيح...
es: Verificando llavero...

# processing.health.verifying_keys
source: Verifying keys...
ar: جارٍ التحقق من المفاتيح...
es: Verificando claves...

# processing.health.testing_network
source: Testing network...
ar: جارٍ اختبار الشبكة...
es: Probando red...

# processing.health.calculating_score
source: Calculating health score...
ar: جارٍ حساب درجة الصحة...
es: Calculando puntuación...

# processing.network.checking_connectivity
source: Checking connectivity...
ar: جارٍ فحص الاتصال...
es: Verificando conectividad...

# processing.network.analyzing
source: Analyzing network...
ar: جارٍ تحليل الشبكة...
es: Analizando red...

# processing.new_address.deriving_key
source: Deriving key...
ar: جارٍ اشتقاق المفتاح...
es: Derivando clave...

# processing.new_address.verifying
source: Verifying address...
ar: جارٍ التحقق من العنوان...
es: Verificando dirección...

# processing.export.gathering_data
source: Gathering transaction data...
ar: جارٍ جمع بيانات المعاملات...
es: Recopilando datos...

# processing.export.formatting_file
source: Formatting export file...
ar: جارٍ تنسيق ملف التصدير...
es: Formateando archivo...

# processing.import.validating_seed
source: Validating seed phrase...
ar: جارٍ التحقق من عبارة الاسترداد...
es: Validando frase semilla...

# processing.import.deriving_keys
source: Deriving keys...
ar: جارٍ اشتقاق المفاتيح...
es: Derivando claves...

# processing.import.scanning_blockchain
source: Scanning blockchain...
ar: جارٍ مسح البلوكتشين...
es: Escaneando blockchain...

# processing.import.syncing
source: Syncing wallet...
ar: جارٍ مزامنة المحفظة...
es: Sincronizando billetera...

# processing.import.building_utxos
source: Building UTXO set...
ar: جارٍ بناء مجموعة UTXO...
es: Construyendo conjunto UTXO...

# processing.create.generating_entropy
source: Generating entropy...
ar: جارٍ توليد الإنتروبيا...
es: Generando entropía...

# processing.create.creating_seed
source: Creating seed phrase...
ar: جارٍ إنشاء عبارة الاسترداد...
es: Creando frase semilla...

# processing.create.deriving_keys
source: Deriving keys...
ar: جارٍ اشتقاق المفاتيح...
es: Derivando claves...

# processing.create.securing_keychain
source: Securing in keychain...
ar: جارٍ التأمين في سلسلة المفاتيح...
es: Asegurando en llavero...

# processing.delete.authenticating
source: Authenticating...
ar: جارٍ المصادقة...
es: Autenticando...

# processing.delete.erasing_keys
source: Erasing keys...
ar: جارٍ مسح المفاتيح...
es: Borrando claves...

# processing.delete.clearing_data
source: Clearing data...
ar: جارٍ مسح البيانات...
es: Limpiando datos...

# processing.backup.authenticating
source: Authenticating...
ar: جارٍ المصادقة...
es: Autenticando...

# processing.backup.decrypting
source: Decrypting seed...
ar: جارٍ فك تشفير البذرة...
es: Descifrando semilla...

# processing.bump_fee.creating_replacement
source: Creating replacement tx...
ar: جارٍ إنشاء معاملة بديلة...
es: Creando tx de reemplazo...

# processing.bump_fee.signing
source: Signing transaction...
ar: جارٍ توقيع المعاملة...
es: Firmando transacción...

# processing.bump_fee.broadcasting
source: Broadcasting to network...
ar: جارٍ البث إلى الشبكة...
es: Transmitiendo a la red...

# processing.consolidate.selecting_utxos
source: Selecting UTXOs...
ar: جارٍ اختيار UTXOs...
es: Seleccionando UTXOs...

# processing.consolidate.building_tx
source: Building transaction...
ar: جارٍ بناء المعاملة...
es: Construyendo transacción...

# processing.consolidate.signing
source: Signing transaction...
ar: جارٍ توقيع المعاملة...
es: Firmando transacción...

# processing.consolidate.broadcasting
source: Broadcasting to network...
ar: جارٍ البث إلى الشبكة...
es: Transmitiendo a la red...

# processing.test_connection.pinging_server
source: Pinging server...
ar: جارٍ اختبار الخادم...
es: Probando servidor...

# processing.test_connection.checking_api
source: Checking API...
ar: جارٍ فحص الـ API...
es: Verificando API...

# processing.test_connection.measuring_latency
source: Measuring latency...
ar: جارٍ قياس زمن الاستجابة...
es: Midiendo latencia...

# processing.change_server.testing_server
source: Testing new server...
ar: جارٍ اختبار الخادم الجديد...
es: Probando nuevo servidor...

# processing.change_server.validating_api
source: Validating API...
ar: جارٍ التحقق من الـ API...
es: Validando API...

# processing.change_server.switching
source: Switching server...
ar: جارٍ تبديل الخادم...
es: Cambiando servidor...

# processing.rescan.scanning_addresses
source: Scanning addresses...
ar: جارٍ مسح العناوين...
es: Escaneando direcciones...

# processing.rescan.fetching_history
source: Fetching history...
ar: جارٍ جلب السجل...
es: Obteniendo historial...

# processing.rescan.building_utxos
source: Building UTXO set...
ar: جارٍ بناء مجموعة UTXO...
es: Construyendo conjunto UTXO...

# processing.rescan.finalizing
source: Finalizing...
ar: جارٍ الإنهاء...
es: Finalizando...

# processing.sign_message.authenticating
source: Authenticating...
ar: جارٍ المصادقة...
es: Autenticando...

# processing.sign_message.signing
source: Signing message...
ar: جارٍ توقيع الرسالة...
es: Firmando mensaje...

# processing.verify_message.parsing_signature
source: Parsing signature...
ar: جارٍ تحليل التوقيع...
es: Analizando firma...

# processing.verify_message.verifying_proof
source: Verifying proof...
ar: جارٍ التحقق من الإثبات...
es: Verificando prueba...

# processing.spending.fetching_transactions
source: Fetching transactions...
ar: جارٍ جلب المعاملات...
es: Obteniendo transacciones...

# processing.spending.calculating
source: Calculating spending...
ar: جارٍ حساب الإنفاق...
es: Calculando gastos...

# processing.spending.generating_summary
source: Generating summary...
ar: جارٍ إنشاء الملخص...
es: Generando resumen...

# processing.mempool.connecting
source: Connecting to mempool...
ar: جارٍ الاتصال بالميمبول...
es: Conectando al mempool...

# processing.mempool.fetching_mempool
source: Fetching mempool data...
ar: جارٍ جلب بيانات الميمبول...
es: Obteniendo datos del mempool...

# processing.mempool.analyzing
source: Analyzing mempool...
ar: جارٍ تحليل الميمبول...
es: Analizando mempool...
